app/views/questions/index.html.erb

SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---

         <%if pregunta.answers.count >0 && @proyecto.answers.exists?(question_id: pregunta.id) %>