app/views/users/index.html.erb

SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
---
        <li><%= link_to user.username, user_path(user)%></li>
        <li><small><%= pluralize(user.projects.count, "proyectos") if user.projects %></small></li>