app/views/users/show.html.erb


        <% @user.projects.each do |project|%>
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]