app/views/answers/edit.html.erb


      <td><%= @preguntas.find(16).question %></td>
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]