app/views/answers/index.html.erb

        <%if proyecto.id == request.path.split('.').last.to_f%>
               <% proyecto.answers.each do |respuesta| %>
                <tr>
                  <td><%= @pregunta.find(respuesta.question_id).question %></td>
---
SELECT "answers".* FROM "answers"
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]