app/views/answers/new.html.erb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= @preguntas.find(1).question %></td>