app/controllers/answers_controller.rb

    def show
        @respuesta = Answer.find(params[:id])
        @pregunta = Question.find(@respuesta.question_id)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

    def create
        @preguntas = Question.all
        @respuesta = Answer.new(respuesta_params)
        @respuesta.question_id = @@id
        @respuesta.value = 1
        if @respuesta.save
            @respuesta_proyecto = AnswersProject.new
            @respuesta_proyecto.project_id = get_current_project
            @respuesta_proyecto.answer_id = @respuesta.id
            @respuesta_proyecto.created_at = Time.now
---
SELECT "questions".* FROM "questions"
INSERT INTO "answers" ("answer", "value", "question_id") VALUES (?, ?, ?)  [["answer", "bien gg"], ["value", 1], ["question_id", 1]]
INSERT INTO "answers_projects" ("project_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["answer_id", 3], ["created_at", 2017-05-04 01:53:41 UTC], ["updated_at", 2017-05-04 01:53:41 UTC]]

    def index
        @respuestas = Answer.all
        @pregunta = Question.all
        @proyectos = Project.all
---
SELECT "answers".* FROM "answers"
SELECT "questions".* FROM "questions"
SELECT "projects".* FROM "projects"

    def edit
        @preguntas = Question.all
        @respuesta = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @respuesta = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]