app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"
---
    def index
        @projects = Project.paginate(page: params[:page], per_page: 15)

INSERT INTO "projects" ("area", "amount", "starting", "ending", "description", "location", "volunteers", "problem", "serves_num_people", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @project = Project.new(project_params)
        @project.user = current_user
        if  @project.save

UPDATE "projects" SET "amount" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["amount", 0.7e1], ["updated_at", 2017-05-02 13:10:52 UTC], ["id", 1]]
---
    def update
        if @project.update(project_params)