app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
    	@preguntas = Question.all
        @project_id = request.original_url.split('.').last
        set_current_project(@project_id)
        if(@project_id != "0")
            @proyecto = Project.find(@project_id)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@pregunta = Question.find(params[:id])

INSERT INTO "questions" ("question", "value", "area", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question", "¿Cómo estás?"], ["value", 4], ["area", "Sentimientos"], ["created_at", 2017-05-02 12:46:04 UTC], ["updated_at", 2017-05-02 12:46:04 UTC]]
---
	def create
		@pregunta = Question.new(pregunta_params)
		if @pregunta.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
     def edit
         @pregunta = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "area" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["area", "General"], ["updated_at", 2017-05-04 03:42:48 UTC], ["id", 1]]
---
    def update
	  @pregunta = Question.find(params[:id])
	  if @pregunta.update(pregunta_params)