app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."mail" = ? LIMIT ?  [["mail", "victor@ejemplo.com"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(mail: params[:session][:mail].downcase)