app/controllers/sessions_controller.rb

    def create
      user = User.find_by(correo: params[:session][:correo].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."correo" = ? LIMIT ?  [["correo", "victor@ejemplo.com"], ["LIMIT", 1]]