app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
    def index
       @users = User.paginate(page: params[:page], per_page: 15)

INSERT INTO "users" ("name", "mail", "telephone_number", "last_name", "second_last_name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Elizabethh"], ["updated_at", 2017-05-02 13:11:23 UTC], ["id", 1]]
---
    def update
        if @user.update(user_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 2]]
---
    def show
        @user_articles= @user.projects.paginate(page: params[:page])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
        set_user
        @user.destroy