app/views/layouts/_navigation.html.erb

SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 5]]
---

          <%if current_user.projects.count >0 || current_user.admin%>